Revit 2027 API
ParameterTypeId.LayerElemBaseConstraint Property
 "Base Constraint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LayerElemBaseConstraint { get; }
Public Shared ReadOnly Property LayerElemBaseConstraint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LayerElemBaseConstraint {
	ForgeTypeId^ get ();
}
static member LayerElemBaseConstraint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace